{
  "en": {
    "GameName": "Pirates vs. Numbers",
    "Level_1_Part_1": "There it is… the famous crocodile pirate ship. They look calm now, but I know they’re up to their usual mischief. Those strange cannons must be hiding something. I better stay alert!",
    "Level_1_Part_2": "There it is! The pirate ship is starting to cause a stir. Those cannons are glowing, and they’re pointed at the beach. Time to act and stop their playful chaos!",
    "Level_1_Part_3": "My cannon is ready! But it seems it only works with magical spheres that match the 10x multiplier. I’ll need to grab the correct ones from the beach to neutralize their cannons!",
    "Level_1_Part_4": "Hmm… place value is the trick here. Each digit is ten times the value of the one to its right. I’ll have to choose carefully!",
    "Level_1_Part_5": "Alright, let’s get started! Use the W, A, S, D keys or arrow keys to move around. To pick up or drop a magical sphere, press the E key. I’ve got this… those pirates won’t see it coming!",
    "Level_2_Part_1": "These crocodile pirates just don’t give up, do they? Always causing trouble! Well, if they want to play games, I’ll show them I’m ready!",
    "Level_2_Part_2": "Wait a second… they’ve brought in another cannon! That’s two now. They’re really stepping up their mischief. Time to focus and stop them!",
    "Level_2_Part_3": "Perfect timing! My magical cannons are here to even the odds. With 1x, 10x, 100x, and 1000x multipliers, I’ll need to match the right magical sphere to the right cannon. Precision is key!",
    "Level_2_Part_4": "What’s this? Crabs! They’re stirring up sand and hiding the numbers! I’ll need to stay patient and wait for the sand to clear to see the numbers again. Pesky little troublemakers!",
    "Level_2_Part_5": "Huh… something’s different this time. The cannons aren’t in order! Looks like they were set up in a rush to counter the attack. I’ll need to stay sharp and pay close attention!",
    "Level_3_Part_1": "Another ship? These crocodile pirates just don’t know when to stop. It looks like they’re trying to cause trouble all around the castle!",
    "Level_3_Part_1B": "What? Two smaller boats emerging from behind the main ship? These crocodile pirates are getting trickier—I’ll need to stay sharp and dodge their energy spheres!",
    "Level_3_Part_2": "They’re not wasting any time… their magical cannons are showing. They’ve got some clever tricks, but I’m ready for them!",
    "Level_3_Part_3": "A division cannon! Fascinating… now I’ll need to divide the value of the magical spheres to match their targets. Time to show off my math skills!",
    "Level_3_Part_4": "These cracks on the ground… their energy blasts are leaving marks! I’ll have to jump over them to stay safe. Spacebar, don’t let me down!",
    "Level_4_Part_1": "Multiplication and division cannons? This changes everything! I need to remember: multiplication increases a number by a factor, while division breaks it into equal parts. Let’s stay sharp!",
    "Level_4_Part_2": "What’s that? Shark fins! Those sneaky crocs must have sent them to stir up trouble. If they block the cannon numbers, I’ll have to rely on my memory and act fast!",
    "Level_5_Part_1": "The great croc ship is here! This final challenge will test not only my mathematical precision but also all my agility and focus. I’m ready!",
    "Level_5_Part_3": "Finally! The last of those croc pirates have retreated. They underestimated the power of strategy and determination. Numeria is safe once again, thanks to quick thinking and precise calculations!",
    "Level_5_Part_4": "It’s amazing how understanding the value of numbers can make such a difference. Multiplying, dividing, and knowing their place—it all adds up to victory! Math truly is a magical tool.",
    "Level_5_Part_5": "Thank you for helping me protect our island and outsmart those mischief-makers. I couldn’t have done it without you. Until next time, brave defender—keep your skills sharp for the adventures ahead!",
    "Level_Intro_Part_1": "On the peaceful island of Numeria, harmony and learning flourish under the care of its Guardians...",
    "Level_Intro_Part_2": "Zane, a young and clever guardian, ensures the island remains a place of wonder and balance...",
    "Level_Intro_Part_3": "But one day, a playful fleet of crocodile pirates arrives, causing chaos on the beach with their mischief...",
    "Level_Intro_Part_4": "Luckily, Zane has a secret skill: his mastery of mathematics and the power of magical light spheres...",
    "Level_Intro_Part_5": "Can Zane use his knowledge to restore balance and keep Numeria a place of peace and learning?",
    "btn_Continue": "Continue",
    "btn_NewGame": "New Game"
  },
  "es": {
    "GameName": "",
    "Level_1_Part_1": ".",
    "Level_1_Part_2": ".",
    "Level_1_Part_3": ".",
    "Level_1_Part_4": ".",
    "Level_1_Part_5": ".",
    "Level_2_Part_1": ".",
    "Level_2_Part_2": ".",
    "Level_2_Part_3": ".",
    "Level_2_Part_4": ".",
    "Level_2_Part_5": ".",
    "Level_3_Part_1": ".",
    "Level_3_Part_1B": ".",
    "Level_3_Part_2": ".",
    "Level_3_Part_3": ".",
    "Level_3_Part_4": ".",
    "Level_4_Part_1": ".",
    "Level_4_Part_2": ".",
    "Level_5_Part_1": ".",
    "Level_5_Part_2": ".",
    "Level_5_Part_3": ".",
    "Level_5_Part_4": ".",
    "Level_5_Part_5": "-",
    "Level_Intro_Part_1": ".",
    "Level_Intro_Part_2": ".",
    "Level_Intro_Part_3": ".",
    "Level_Intro_Part_4": ".",
    "Level_Intro_Part_5": ".",
    "btn_Continue": "Continuar",
    "btn_NewGame": "Nuevo Juego"
 },
"_meta": {
        "maxChars": {
            "GameName": 1000,
            "btn_NewGame": 1000,
            "btn_Continue": 1000,
            "Level_Intro_Part_1": 1000,
            "Level_Intro_Part_2": 1000,
            "Level_Intro_Part_3": 1000,
            "Level_Intro_Part_4": 1000,
            "Level_Intro_Part_5": 1000,
            "Level_1_Part_1": 1000,
            "Level_1_Part_2": 1000,
            "Level_1_Part_3": 1000,
            "Level_1_Part_4": 1000,
            "Level_1_Part_5": 1000,
            "Level_2_Part_1": 1000,
            "Level_2_Part_2": 1000,
            "Level_2_Part_3": 1000,
            "Level_2_Part_4": 1000,
            "Level_2_Part_5": 1000,
            "Level_3_Part_1": 1000,
            "Level_3_Part_2": 1000,
            "Level_3_Part_3": 1000,
            "Level_3_Part_4": 1000,
            "Level_3_Part_1B": 1000,
            "Level_4_Part_1": 1000,
            "Level_4_Part_2": 1000,
            "Level_5_Part_1": 1000,
            "Level_5_Part_2": 1000,
            "Level_5_Part_3": 1000,
            "Level_5_Part_4": 1000,
            "Level_5_Part_5": 1000
        }
    }
}