{
	"en": {
		"GameName": "Fraction Feast, Pizza Paradise",
		"btn_NewGame": "New Game",
		"btn_Continue": "Continue",
		
		
		"Level_1_Part_1": "Welcome to Turtle Pizza Paradise! Our customers are hungry, and it’s your job to deliver the perfect slice!",
		"Level_1_Part_2": "Before we start delivering pizzas, let’s take a quick look at something important!",  
		"Level_1_Part_3": "This is a number line. It begins at 0 and ends at 1.",  
		"Level_1_Part_4": "We can split it into equal sections. These sections are called FRACTIONS.",  
		"Level_1_Part_5": "Fractions are written with two numbers—one on top and one on the bottom.",  
		"Level_1_Part_6": "The bottom number, the DENOMINATOR, tells us how many equal parts the whole is divided into.",  
		"Level_1_Part_7": "The top number, the NUMERATOR, shows how many parts we are focusing on.",  
		"Level_1_Part_8": "Let’s add another number line and divide it into 4 equal parts.",  
		"Level_1_Part_9": "Now the DENOMINATOR is 4 because the whole is split into 4 sections.",  
		"Level_1_Part_10": "Look! These two fractions are in the same place on the line. That means they are EQUIVALENT FRACTIONS!",  
		"Level_1_Part_11": "Let’s add a third number line and divide it into 8 equal parts.",  
		"Level_1_Part_12": "Now the DENOMINATOR is 8, since the line is cut into 8 pieces.",  
		"Level_1_Part_13": "Check it out! We can now see even more EQUIVALENT FRACTIONS!",  
		"Level_1_Part_14": "Now that we know how fractions work, it's time to put our skills to the test!",  
		"Level_1_Part_15": "A customer’s order might look different from the slice you’re carrying, but if they’re equivalent, it’s a perfect match! Pay close attention and serve wisely!",
		"Level_1_Part_16": "Use W, A, S, D or the arrow keys to move around the beach. No need to press a button to deliver—just walk up to the right turtle and hand them their perfect slice!",
		
		"TutoNum": "NUMERATOR",
		"TutoDen": "DENOMINATOR",
		
		
		
				
		
		
		
		
		
		
		"Level_2_Part_1": "Things are heating up at Turtle Pizza Paradise! Now, customers might ask for their pizza using fraction symbols or a pizza icon that shows the slice they want. Pay close attention!",
		"Level_2_Part_2": "A whole pizza can look different depending on how it's sliced, but the fractions should still be equivalent. Make sure you match the right order!",
		"Level_2_Part_3": "Watch out! Some small creatures are moving around the beach. Those spiky-shelled snails might slow you down if you get too close. Stay sharp and keep those deliveries on time!",
		"Level_3_Part_1": "Looks like we have a new... customer? A crab has appeared on the beach, and it seems pretty interested in your pizzas! But watch out—it throws its claws, and they’re not asking for a tip!",
		"Level_3_Part_2": "The path is getting longer, so stay focused and keep those deliveries moving. Remember, a perfect slice means a happy customer... and fewer angry crabs!",
		"Level_4_Part_1": "The sun has set, but the pizza rush never stops! Customers are still hungry, even at night. Keep your eyes open and your deliveries sharp!",
		"Level_4_Part_2": "Something is lurking in the darkness… We’re not sure what it is, but it shoots glowing energy balls! Maybe it just wants a slice? Either way, stay out of its way!",
		"Level_4_Part_3": "Wait… square pizzas? That’s right! Some customers will now ask for their slices using square-shaped pizzas. It may look different, but don’t let that confuse you—fractions are still fractions!",
		"Level_5_Part_1": "Dash! Watch out! There’s a new creature lurking near the water. It looks like a frog... but it sure has a long tongue! Be careful—it might try to 'taste' your delivery!",
		"Level_5_Part_2": "First square pizzas, now triangular ones?! Our customers sure have unique tastes! But remember, no matter the shape, the fractions must still match!",
		"Level_6_Part_1": "Round, square, triangular—our customers are getting creative with their orders! Keep your focus and remember: different shapes, same fractions!",
		"Level_7_Part_1": "Watch out! Pufferfish ahead! When they get startled, they explode—sending sharp spines flying everywhere! Move carefully, or you’ll end up as a very slow delivery turtle...",
		"Level_7_Part_2": "As if the dark wasn’t enough... now it’s raining! But hungry customers don’t take breaks, so neither can you. Keep those pizzas dry and those orders right!",
		"Level_8_Part_1": "Finally, the sun is up, and the rain is gone! But don’t celebrate just yet... there’s a new sea creature around. These glowing fish may look cool, but their lights pack a surprise—stay out of their laser beams!",
		"Level_8_Part_2": "Daylight makes deliveries easier, but the challenge isn’t over! Stay sharp, dodge those glowing fish, and keep those pizzas heading to the right turtles!",
		"Level_8_Part_3": "Incredible work, Dash! You’ve delivered every last pizza with speed and accuracy. The turtles are full and happy, all thanks to your fraction skills!",
		"Level_8_Part_4": "Understanding equivalent fractions wasn’t just about pizzas it helped you make the right choices, no matter how the orders were shown. Fractions are everywhere, and now you’re a pro at spotting them!",
		"Level_8_Part_5": "Thanks for being the best pizza delivery turtle on the island! Keep practicing your fraction skills, and who knows? Maybe your next challenge will be even bigger! See you next time, Dash!"
	},
	"es": {
		"GameName": "",
		"btn_NewGame": "Nuevo Juego",
		"btn_Continue": "Continuar",
		"Level_1_Part_1": "",
		"Level_1_Part_2": "",
		"Level_1_Part_3": "",
		"Level_1_Part_4": "",
		"Level_1_Part_5": "",
		"Level_2_Part_1": "",
		"Level_2_Part_2": "",
		"Level_2_Part_3": "",
		"Level_3_Part_1": "",
		"Level_3_Part_2": "",
		"Level_4_Part_1": "",
		"Level_4_Part_2": "",
		"Level_4_Part_3": "",
		"Level_5_Part_1": "",
		"Level_5_Part_2": "",
		"Level_6_Part_1": "",
		"Level_7_Part_1": "",
		"Level_7_Part_2": "",
		"Level_8_Part_1": "",
		"Level_8_Part_2": "",
		"Level_8_Part_3": "",
		"Level_8_Part_4": "",
		"Level_8_Part_5": ""
	}
}